---

# Extract

Extração de Dados a partir da API de [Star Wars](https://swapi.dev/api).

---

In [1]:
# importação das bibliotecas json para trabalhar com a estrutura de dados e requests para solicitação de requisição da API
import json
import requests

In [2]:
# obtenção das urls dos objetos a serem trabalhados
url_people = 'https://swapi.dev/api/people/'
url_planets =  'https://swapi.dev/api/planets/'
url_starships = 'https://swapi.dev/api/starships/'

### Extração de Dados dos Planetas

In [3]:
list_planets = []

for i in range(1,61):
  planet = []
  request = requests.get(url_planets + str(i))
  if request.status_code == 200:
    api_result = json.loads(request.content)
    planet.append(i)
    planet.append(api_result['name'])
    planet.append(api_result['rotation_period'])
    planet.append(api_result['orbital_period'])
    planet.append(api_result['diameter'])
    planet.append(api_result['climate'])
    planet.append(api_result['population'])
    list_planets.append(planet)

### Extração de Dados dos Pilotos

In [4]:
list_people = []

for i in range(1,84):
  person = []
  request = requests.get(url_people + str(i))
  if request.status_code == 200:
    api_result = json.loads(request.content)
    person.append(i)
    person.append(api_result['name'])
    person.append(api_result['birth_year'])
    person.append(api_result['homeworld'][30:].replace('/',''))
    list_people.append(person)

### Extração de Dados das Naves

In [5]:
list_starships = []

for i in range(1,76):
  starship = []
  request = requests.get(url_starships + str(i))
  if request.status_code == 200:
    api_result = json.loads(request.content)
    starship.append(i)
    starship.append(api_result['name'])
    starship.append(api_result['model'])
    starship.append(api_result['passengers'])
    starship.append(api_result['cargo_capacity'])
    starship.append(api_result['starship_class'])
    list_starships.append(starship)

---

# Transform

Utilização do Pandas para alterar os tipos das colunas.

---

In [6]:
# importação da biblioteca pandas
import pandas as pd
import numpy as np

### Registros de Planetas

In [7]:
# criação de dataframe a partir da lista de registros 'list_planets'
df_planetas = pd.DataFrame(list_planets)
df_planetas.info()
df_planetas.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       60 non-null     int64
 1   1       60 non-null     object
 2   2       60 non-null     object
 3   3       60 non-null     object
 4   4       60 non-null     object
 5   5       60 non-null     object
 6   6       60 non-null     object
dtypes: int64(1), object(6)
memory usage: 3.4+ KB

   0         1   2     3      4                    5           6
0  1  Tatooine  23   304  10465                 arid      200000
1  2  Alderaan  24   364  12500            temperate  2000000000
2  3  Yavin IV  24  4818  10200  temperate, tropical        1000
3  4      Hoth  23   549   7200               frozen     unknown
4  5   Dagobah  23   341   8900                murky     unknown

In [8]:
# renomeação das colunas
df_planetas = df_planetas.rename(columns={0:'IdPlaneta', 1:'Nome', 2:'Rotacao', 3:'Orbita', 4:'Diametro', 5:'Clima', 6:'Populacao'})
df_planetas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   IdPlaneta  60 non-null     int64
 1   Nome       60 non-null     object
 2   Rotacao    60 non-null     object
 3   Orbita     60 non-null     object
 4   Diametro   60 non-null     object
 5   Clima      60 non-null     object
 6   Populacao  60 non-null     object
dtypes: int64(1), object(6)
memory usage: 3.4+ KB

In [9]:
# converão de colunas para tipos numéricos
df_planetas['Rotacao'] = pd.to_numeric(df_planetas['Rotacao'], downcast='float', errors='coerce')
df_planetas['Orbita'] = pd.to_numeric(df_planetas['Orbita'], downcast='float', errors='coerce')
df_planetas['Diametro'] = pd.to_numeric(df_planetas['Diametro'], downcast='float', errors='coerce')
df_planetas['Populacao'] = pd.to_numeric(df_planetas['Populacao'], errors='coerce')
df_planetas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   IdPlaneta  60 non-null     int64
 1   Nome       60 non-null     object
 2   Rotacao    48 non-null     float32
 3   Orbita     48 non-null     float32
 4   Diametro   44 non-null     float32
 5   Clima      60 non-null     object
 6   Populacao  43 non-null     float64
dtypes: float32(3), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [10]:
# substituição de valores nulos por 0 (zero)
df_planetas = df_planetas.replace(np.nan, 0)
df_planetas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   IdPlaneta  60 non-null     int64
 1   Nome       60 non-null     object
 2   Rotacao    60 non-null     float32
 3   Orbita     60 non-null     float32
 4   Diametro   60 non-null     float32
 5   Clima      60 non-null     object
 6   Populacao  60 non-null     float64
dtypes: float32(3), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [11]:
# converão da coluna 'Populacao' para tipo Int64 (longint)
df_planetas['Populacao'] = df_planetas['Populacao'].astype('Int64')
df_planetas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   IdPlaneta  60 non-null     int64
 1   Nome       60 non-null     object
 2   Rotacao    60 non-null     float32
 3   Orbita     60 non-null     float32
 4   Diametro   60 non-null     float32
 5   Clima      60 non-null     object
 6   Populacao  60 non-null     Int64
dtypes: Int64(1), float32(3), int64(1), object(2)
memory usage: 2.8+ KB

### Registros de Pilotos

In [12]:
# criação de dataframe a partir da lista de registros 'list_people'
df_pilotos = pd.DataFrame(list_people)
df_pilotos.info()
df_pilotos.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       82 non-null     int64
 1   1       82 non-null     object
 2   2       82 non-null     object
 3   3       82 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.7+ KB

   0               1        2  3
0  1  Luke Skywalker    19BBY  1
1  2           C-3PO   112BBY  1
2  3           R2-D2    33BBY  8
3  4     Darth Vader  41.9BBY  1
4  5     Leia Organa    19BBY  2

In [13]:
# renomeação das colunas
df_pilotos = df_pilotos.rename(columns={0:'IdPiloto', 1:'Nome', 2:'AnoNascimento', 3:'IdPlaneta'})
df_pilotos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   IdPiloto       82 non-null     int64
 1   Nome           82 non-null     object
 2   AnoNascimento  82 non-null     object
 3   IdPlaneta      82 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.7+ KB

In [14]:
# converão da coluna 'IdPlaneta' para tipo numérico
df_pilotos['IdPlaneta'] = pd.to_numeric(df_pilotos['IdPlaneta'], errors='coerce')
df_pilotos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   IdPiloto       82 non-null     int64
 1   Nome           82 non-null     object
 2   AnoNascimento  82 non-null     object
 3   IdPlaneta      82 non-null     int64
dtypes: int64(2), object(2)
memory usage: 2.7+ KB

### Registros de Naves

In [15]:
# criação de dataframe a partir da lista de registros 'list_starships'
df_naves = pd.DataFrame(list_starships)
df_naves.info()
df_naves.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       36 non-null     int64
 1   1       36 non-null     object
 2   2       36 non-null     object
 3   3       36 non-null     object
 4   4       36 non-null     object
 5   5       36 non-null     object
dtypes: int64(1), object(5)
memory usage: 1.8+ KB

,0,1,2,3,4,5
0,2,CR90 corvette,CR90 corvette,600,3000000,corvette
1,3,Star Destroyer,Imperial I-class Star Destroyer,n/a,36000000,Star Destroyer
2,5,Sentinel-class landing craft,Sentinel-class landing craft,75,180000,landing craft
3,9,Death Star,DS-1 Orbital Battle Station,"843,342",1000000000000,Deep Space Mobile Battlestation
4,10,Millennium Falcon,YT-1300 light freighter,6,100000,Light freighter

In [16]:
# renomeação das colunas
df_naves = df_naves.rename(columns={0:'IdNave', 1:'Nome', 2:'Modelo', 3:'Passageiro', 4:'Carga', 5:'Classe'})
df_naves.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   IdNave      36 non-null     int64
 1   Nome        36 non-null     object
 2   Modelo      36 non-null     object
 3   Passageiro  36 non-null     object
 4   Carga       36 non-null     object
 5   Classe      36 non-null     object
dtypes: int64(1), object(5)
memory usage: 1.8+ KB

In [17]:
# converão de colunas para tipos numéricos
df_naves['Passageiro'] = pd.to_numeric(df_naves['Passageiro'], errors='coerce')
df_naves['Carga'] = pd.to_numeric(df_naves['Carga'], downcast='float', errors='coerce')
df_naves.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   IdNave      36 non-null     int64
 1   Nome        36 non-null     object
 2   Modelo      36 non-null     object
 3   Passageiro  31 non-null     float64
 4   Carga       29 non-null     float32
 5   Classe      36 non-null     object
dtypes: float32(1), float64(1), int64(1), object(3)
memory usage: 1.7+ KB

In [18]:
# substituição de valores nulos por 0 (zero)
df_naves = df_naves.fillna(0)
df_naves.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   IdNave      36 non-null     int64
 1   Nome        36 non-null     object
 2   Modelo      36 non-null     object
 3   Passageiro  36 non-null     float64
 4   Carga       36 non-null     float32
 5   Classe      36 non-null     object
dtypes: float32(1), float64(1), int64(1), object(3)
memory usage: 1.7+ KB

---

# Load

Carregamento no Banco de Dados já modelado do SQL Server.

---

In [19]:
# Importação da biblioteca pyodbc para criar conexão com o SGBD SQL Server
import pyodbc

str_conn = (
            "Driver={SQL Server};"
            "Server=LUND\SQLEXPRESS;"
            "Database=StarWars;"
            "Trusted_Connection=yes;"
            )
conn = pyodbc.connect(str_conn)
cursor = conn.cursor()

### Carregamento na Tabela Planetas

In [20]:
for index, row in df_planetas.iterrows():
    cursor.execute(f"""INSERT INTO Planetas(IdPlaneta, Nome, Rotacao, Orbita, Diametro, Clima, Populacao) 
                        VALUES({row['IdPlaneta']}, '{row['Nome']}', {row['Rotacao']}, 
                                {row['Orbita']}, {row['Diametro']}, '{row['Clima']}', 
                                {row['Populacao']})""")
    cursor.commit()

### Carregamento na Tabela Pilotos

In [21]:
for index, row in df_pilotos.iterrows():
    cursor.execute(f"""INSERT INTO Pilotos(IdPiloto, Nome, AnoNascimento, IdPlaneta) 
                        VALUES({row['IdPiloto']}, '{row['Nome']}', '{row['AnoNascimento']}', 
                                {row['IdPlaneta']})""")
    cursor.commit()

### Carregamento na Tabela Naves

In [22]:
for index, row in df_naves.iterrows():
    cursor.execute(f"""INSERT INTO Naves(IdNave, Nome, Modelo, Passageiro, Carga, Classe) 
                        VALUES({row['IdNave']}, '{row['Nome']}', '{row['Modelo']}', 
                                {row['Passageiro']}, {row['Carga']}, '{row['Classe']}')""")
    cursor.commit()

### Finalização da Conexão com o SGBD

In [23]:
cursor.close()
conn.close()